---
title: CreateRelatedFileProgressChangedEventArgs
classe: Autodesk.Revit.DB.Events.CreateRelatedFileProgressChangedEventArgs
namespace: Autodesk.Revit.DB.Events
eredita: Autodesk.Revit.DB.Events.DataTransferProgressChangedEventArgs
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 3
---

# CreateRelatedFileProgressChangedEventArgs

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean CreatingCloudSharedLocal { get; }` | `createRelatedFileProgressChangedEventArgs.CreatingCloudSharedLocal` | Boolean |
| `Boolean DownloadFinished { get; }` | `createRelatedFileProgressChangedEventArgs.DownloadFinished` | Boolean |
| `Boolean FullDownload { get; }` | `createRelatedFileProgressChangedEventArgs.FullDownload` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```